foamfiles/counterFlowFlame2D/case_5092592593/0/details
Velocity
50.92592593